Revit 2026 API

# DirectShapeTypeIsValidShape(IListGeometryObject, DirectShapeTargetViewType) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidShape(
	IList<GeometryObject> shape,
	DirectShapeTargetViewType viewType
)
```
```vb
Public Function IsValidShape (
	shape As IList(Of GeometryObject),
	viewType As DirectShapeTargetViewType
) As Boolean
```
```cpp
public:
bool IsValidShape(
	IList<GeometryObject^>^ shape,
	DirectShapeTargetViewType viewType
)
```
```fsharp
member IsValidShape :
        shape : IList<GeometryObject> *
        viewType : DirectShapeTargetViewType -> bool
```

#### Parameters

shape IListGeometryObject

viewType DirectShapeTargetViewType

#### Return Value

Boolean

#### Reference

DirectShapeType Class

IsValidShape Overload

Autodesk.Revit.DB Namespace